{"title":"Casual Hike #1 - Beauty Ledge/Beauty Knob, Moose Mountain Reservation - 10/24/20","slug":"beauty-ledges","order":9,"html":"<h2 id=\"approx-1650-feet---approx-4-mi\">approx. 1650 feet - approx 4 mi.</h2>\n<hr style=\"border: 1px solid black\"><p>My brother and I had been planning to hike Mt. Osceola and East Osceola this weekend, but unfortunately it got rained out. The weather was looking to be drier closer to home, and I wanted to get Lana out on one more adventure, so I decided to go back to Moose Mountain Reservation. I&#39;d been there <a href=\"/summits/Warmup-4-Moose-Mtns\">once before</a> and it wasn&#39;t my favorite, but there are a lot of trails in the area so I figured it was worth another shot. I packed up some stuff the night before, and as usual Lana got all excited and watched very carefully to make sure I packed everything we&#39;d need.</p>\n<p><img src=\"beauty-ledges/expectant-lana.jpg\" alt=\"Lana watching me pack\" style=\"width: 70%\" /></p>\n<p>I spent some time looking at a <a href=\"https://forestsociety.org/sites/default/files/Moose%20Mountains%20Map.pdf\">trail map</a> of the reservation, trying to determine a decent route. I finally decided to take the Beauty Ledge/Beauty Knob trails, as well as take the trail up to the apparently unnamed summit with the little pond on top. I couldn&#39;t find much info about it, except that the trail was a bit overgrown, but the ledges and knob seemed to have decent reviews so I figured it was a safe bet for a quick nearby hike. Here&#39;s a portion of the trail map, with my planned route marked in yellow. The little spur is a branch that goes to the top of Beauty Knob and the ledges.</p>\n<p><img src=\"beauty-ledges/trail-map.jpeg\" alt=\"Trail Map\" style=\"width: 70%\" /></p>\n<p><img src=\"beauty-ledges/trailhead.jpg\" alt=\"The Trailhead\" style=\"width: 70%\" /></p>\n<p>Lana and I arrived at the parking area at first light. It was extremely foggy and a bit damp, nice spooky autumn vibes, but there was no actual precipitation so I decided to go for it. I headed down the main trail away from the parking area and it wasn&#39;t long before I encountered something odd. A small pool of dirty water off the to side of the trail, ringed by rocks, with a sign above it declaring it to be Hall Spring. There appeared to be no flowing water. There was, however, a dirty mug hanging from a nail in a nearby tree. I decided I didn&#39;t want to be cursed (with Giardia), and just took a picture and walked on. Interestingly, I did some googling when I got home and couldn&#39;t find any mention of this Hall Spring. Spooky...</p>\n<p><img src=\"beauty-ledges/hall-spring.jpg\" alt=\"Hall Spring\" style=\"width: 70%\" /></p>\n<p>My trail crossed a rickety bridge with lots of gaps between boards, and turned to the left, following North Trail. This appeared to be an old snowmobile trail or maybe a gravel road, but was very overgrown. There was a gate across the road, but we just went around it. There was another intersection not far past the gate, with signs indication which way to go to get to the Beauty Ledge trail. So far, so good, if a little brushy.</p>\n<p><img src=\"beauty-ledges/overgrown-snowmo-trail.jpg\" alt=\"Overgrown snowmobile trail\" style=\"width: 70%\" />\n<img src=\"beauty-ledges/main-trail-split.jpg\" alt=\"Another intersection\" style=\"width: 70%\" /></p>\n<p>Not far up the trail from the split was the beginning of the Beauty Ledge trail. I 100% would have missed it if not for the sign. The trail is tough to see, especially with leaves all over the ground. It looked like no one had passed this way for a while, the trail seemed steep and rocky, and the fog and dense woods made it so I couldn&#39;t see very far up the path. Getting spookier. We stopped for a quick drink of water before heading up the trail.</p>\n<p><img src=\"beauty-ledges/trail-begins.jpg\" alt=\"Start of the ledge trail\" style=\"width: 70%\" /></p>\n<p>The trail winds its way up the ridge in a series of quick switchbacks. The trail was at times tough to follow. The blazes were far apart and tended to be above head height, and the trail itself was obscured by wet leaves. Lana kpt her nose to the ground and kept us on trail for the most part. I guess she could probably smell the last person to come through. The trail leveled out a bit as we approached the bottom of the ledge itself, although I couldn&#39;t tell that&#39;s where we were until I&#39;d walked a bit farther. It makes for a nice picture, but the fog seriously limited visibility. </p>\n<p><img src=\"beauty-ledges/spooky-autumn-vibes.jpg\" alt=\"Misty trail deep in the woods\" style=\"width: 70%\" /></p>\n<p>Eventually we reached what I presume to be the bottom of the ledges/knob. It looked to me like the trail was going straight up the rocks, so we started to climb, before I fortunately noticed that the trail actually veered to the right, away from the ledge. There were still some slippery rocks, but it was not as bad as climbing straight up the cliff would have been. Just another 50 yards or so and the trail split again, at the little splinter you can see on the map. I decided to save the walk out to the ledge itself for the way back, in the hopes the fog might lift and I could actually see something. Instead, I followed the Beauty Knob trail down the other side of the rise.</p>\n<p><img src=\"beauty-ledges/ledge-view-sign.jpg\" alt=\"Trail split sign\" style=\"width: 70%\" /></p>\n<p><img src=\"beauty-ledges/beauty-knob-trail-sign.jpg\" alt=\"Knob trail sign\" style=\"width: 70%\" /></p>\n<p>The Beauty Knob trail winds its way down the hill in a series of tight switchbacks, much like the previous trail. There were fewer rocks, but the wet leaves still made things a bit treacherous. At the bottom it comes out into a large clearing that looked like the convergence of a couple of snowmobile trails. I looked around for any sign of the trail I intended to take to reach my unnamed summit. Roughly where it should have been, I noticed a pink strip of plastic tied to a bush, and then another farther up, and then maybe another, maybe the hint of a trail? the fog made it hard to tell, and the entrance was completely overgrown. We decided to chance and and barged into the bushes. It didn&#39;t take long for it to open up a little bit, and there was definitely a trail there. I figured we were probably on the right track, although it was clear nobody had ascended this way in quite a while. As we climbed, the trail alternated between open and visible, and completely obscured by brush. I considered turning around at a couple points, but we still pushed on.</p>\n<p><img src=\"beauty-ledges/overgrown-path.jpg\" alt=\"Trail completely overgrown\" style=\"width: 70%\" /></p>\n<p>The fog was not lifting, and it made it very difficult to tell how much farther I had to climb to make it to the top. I pulled my phone out and used Google Maps to try to judge how far I&#39;d gone. Every time I stopped, Lana would whip her head around to look behind us, staring into intently the mist as though something was following us. I think it was just all the water dripping off the trees making it sound like there wass something out there. I didn&#39;t see anything at any rate.</p>\n<p>Just as I was starting to think we were nearly there, the trail got particularly steep. I debated again about turning around, because I was concerned about descending such a steep slope covered in wet leaves. But I was pretty sure I was almost there, and so I kept going, probably against my better judgement. We made it to the top of the steep bit without incident, and the trail leveled out. I reached a point where my phone indicated I was probably at the top, but I didn&#39;t see the little pond on the trail map. The path continued into the woods, descending slightly, so I decided to go on a bit farther and see if I could find it. Just when I was about ready to turn around, I nearly walked into the pond. The fog was extra thick around it. Just at that moment there was a huge crashing sound in the woodsto my left. I whipped my head around, sure that whatever had been haunting us until now was finally making its move. But no, it was just a very large buck, suprisingly close, spooked by us crashing through the brush. It bolted off around the other side of the pond. After I got over my suprise, I snapped a picture of the spooky swamp and we turned around. The trail actually continued past the pond, but I had made it to my goal and didn&#39;t want to make any more porr decisions.</p>\n<p><img src=\"beauty-ledges/summit-bog.jpg\" alt=\"Pond at the summit\" style=\"width: 70%\" /></p>\n<p>We walked back to the true summit and reached the top of the steep part. The trail looked like it just descended into an abyss of mist. I couldn&#39;t quite see to the bottom of this steepest part. The descent down it was about as treacherous as expected, and I did my best to stay near the edges so I could grab trees if I fell. I had one small slip but managed to right myself quickly and didn&#39;t get dirty or wet.</p>\n<p><img src=\"beauty-ledges/misty-descent.jpg\" alt=\"Misty Descent\" style=\"width: 70%\" /></p>\n<p>We continued to make our way down though it was easier going from here. My pants were starting to get a bit wet from pushing through so much shrubbery, but the weather wasn&#39;t too cold so I wasn&#39;t uncomfortable yet. Lana didn&#39;t see to be too bother by the dampness either. We made it back to the clearing and returned to the Beauty Knob Trail. We climbed back up the slippery switchbacks to the top of the knob, this time taking the spur trail. The fog had not lifted at all and the view from the ledge was absolute garbage.</p>\n<p><img src=\"beauty-ledges/beauty-knob.jpg\" alt=\"Top of the Knob\" style=\"width: 70%\" /></p>\n<p><img src=\"beauty-ledges/lana-on-ledges.jpg\" alt=\"View from the ledges\" style=\"width: 70%\" /></p>\n<p>There was this sign that I though was kind of funny, something a character in a horror movie might run past without noticing, only to find themselves trapped as the axe-murderer catches up.</p>\n<p><img src=\"beauty-ledges/to-ledge-sign.jpg\" alt=\"Funny sign - &quot;To Ledge&quot;\" style=\"width: 70%\" /></p>\n<p>After our brief trip out to the ledge, we headed back down the Beauty Ledge trail, picking our way down the slippery rocks. We made it to the bottom, back to the snowmobile trail, and it was smooth sailing from there. I hadn&#39;t seen another soul all morning until we got back to the parking lot, where some people were getting ready to head into the woods. We got back in the car and drove home. </p>\n<p>All in all not a terrible hike. I think if you live close by the ledge might be worth a quick trip on a nice day when you might get a better view. I would not bother climbing up the crappy unnamed peak unless trail maintenance substantially improved. I don&#39;t think I&#39;ll be coming back here though. Trail maintenance is definitly lacking, and I haven&#39;t been too impressed with either hike I&#39;ve done.</p>\n"}