{"title":"Mt. Jackson - 10/11/22","slug":"Mt-Jackson","order":14,"html":"<h2 id=\"4052-feet---52-mi\">4052 feet - 5.2 mi</h2>\n<hr style=\"border: 1px solid black\"><p>When October rolls around, weather in the White Mountains can start to get a little dicey. I figured there were enough good days left to squeeze in one more hike before winter truly hit, and my dad was once again willing to join me. We settled on Mt. Jackson primarily because it was short, both in mileage and altitude. At barely over 5 miles up and down the Webster-Jackson Trail, it is among the shortest 4000 footer hikes and was number 5 on a &#39;Five Easiest 4k-ers&#39; list my dad found, as well as the only one he hadn&#39;t done, making it an easy choice. We had some concerns about the weather the night before since it had been raining/snowing in the Whites the two days before, and the forecast for our hiking day showed no precipitation but cold and high winds. For this reason more than the ruggedness of the trail I decided to leave my dog Lana at home for this one. The hike was supposed to be on the rugged side, although I think it was within her abilities, but I don&#39;t have the right gear to take her out on a mountain in cold, windy, potentially wet weather. I have such gear for myself but I didn&#39;t want to put her at risk if the weather turned bad.</p>\n<p>Since it was a Tuesday late in the season, we didn&#39;t expect huge crowds, and took our time getting out the door in the morning. As we got into Conway, NH, still 40 minutes away from the trailhead, we got an impressive view of Mt. Washington, which was threatentingly snowcapped. My dad started to fret about potential trail conditions on our inteded hike, and I reminded him that the weather still looked clear and our summit was over 2000 feet lower than Washington&#39;s. I think he was mostly concerned about ice on the rocky terrain and the potential for injury.</p>\n<p><img src=\"mt-jackson/washington-from-road.jpg\" alt=\"View of Washington from Conway NH\" style=\"width: 70%\" /></p>\n<p>Dad spent most of the ride gushing about the scenery and trying to take pictures out of the window of the moving car, and at one point we did pull off to snap a picture of Mt. Washington (as well as pee in the woods). We finally made it to the trailhead around 9am, and the weather looked perfect. It was cold but not brutal in the low 30s and the fall colors were beautiful. The was a bit of frost on the ground and the trail was muddy as we set off. </p>\n<p><img src=\"mt-jackson/trailhead-sign.jpg\" alt=\"Starting off at the trailhead\" style=\"width: 70%\" /></p>\n<p>Around a tenth of a mile up the trail is a side trail to Elephant Head, a cliff overlooking Crawford Notch. It&#39;s a nice view and less than a quarter mile to the overlook and is probably worth the detour. We decided to check it out on the way back, because our primary goal was to summit and we still didn&#39;t know if the weather would get worse. </p>\n<p><img src=\"mt-jackson/elephant-head-view.jpg\" alt=\"View from Elephant Head\" style=\"width: 70%\" /></p>\n<p>The trail was typical rocky White Mountains hiking, and the continued to be muddy throughout. About .6 miles uphill was a sign indicating another side trail to Bugle Ledge. This has a similar, but in my opinion better view than Elephant Head, and is also only about 30 feet down the trail so is easily worth it. Once again, we decided to save it for the descent and continued uphill.</p>\n<p><img src=\"mt-jackson/bugle-ledge-view.jpg\" alt=\"View from Bugle Ledge\" style=\"width: 70%\" /></p>\n<p>From there the trail continued at a moderate grade for nearly another 3/4-ths a mile, including a stream crossing, before it dips briefly, and then splits. At the fork we turned left to continue directly to Mt. Jackson. Those with more time and energy may wish to continue on to 3,911-foot Mt. Webster and then follow the ridge trail to the summit of Mt. Jackson. This only adds an extra mile to the hike, but since we were only here for the 4000-footer, we pushed on.</p>\n<p><img src=\"mt-jackson/trail-split.jpg\" alt=\"Trail split towards Mt. Webster\" style=\"width: 70%\" /></p>\n<p>The final mile to the summit is steeper on average than the previous section of trail, but there is plenty of interesting scenery to keep you distracted. Our progress was slow because I kept wanting to take pictures of every stream we crossed and every crag we scrambled over. I easily could have spent an hour simply exploring up and down some of the pretty mountain streams we came across, but I tried to focus on the goal of summitting. The weather was looking good and the trail conditions had been a bit wet but not icy so I was confident by now that weather wouldn&#39;t keep us off the top.</p>\n<p><img src=\"mt-jackson/upstream.jpg\" alt=\"View of a mountain stream\" style=\"width: 70%\" /></p>\n<p><img src=\"mt-jackson/downstream.jpg\" alt=\"View of a mountain stream\" style=\"width: 70%\" /></p>\n<p>As we approached the alpine zone we encountered a couple gray jays, greedy birds who are well known in the Whites to happily take food from an outstretched hand. I&#39;m not typically one to feed the wildlife, but the temptation was too strong and my father and I both let a bird land on our hands and take a little snack. Please don&#39;t feed the wildlife. The birds are one thing, but for love of god don&#39;t feed bears or something.</p>\n<p><img src=\"mt-jackson/alpine-zone-sign.jpg\" alt=\"Sign with rules for the Alpine Zone\" style=\"width: 70%\" /></p>\n<p><img src=\"mt-jackson/gray-jay.jpg\" alt=\"A chubby little gray jay on a branch\" style=\"width: 70%\" /></p>\n<p><img src=\"mt-jackson/gray-jay-feeding.jpg\" alt=\"My dad feeding a gray jay\" style=\"width: 70%\" /></p>\n<p>Shortly after feeding the gray jays we began the final approach to the summit. There are 2 steep scrambles here that made me glad I didn&#39;t bring the dog and would have been very tough if conditions were icy. I think with some assistance Lana could have managed it just fine, but if there had been ice, it  would have been tough to get both of us past it safely. The last 30 feet up to the summit is also bare rock and relatively steep, which would have been tricky had the weather not been beautiful.</p>\n<p><img src=\"mt-jackson/steep-scramble.jpg\" alt=\"A steep scramble\" style=\"width: 70%\" /></p>\n<p><img src=\"mt-jackson/final-approach-1.jpg\" alt=\"The last stretch towards the summit\" style=\"width: 70%\" /></p>\n<p><img src=\"mt-jackson/final-approach-2.jpg\" alt=\"My dad climbing the last stretch\" style=\"width: 70%\" /></p>\n<p>The view from the summit was phenomenal: a perfectly clear day, autumn foliage at it&#39;s peak, and Mt. Washington capped with snow in the distance. This was by far the most impressive vista of any 4000-footer I&#39;d done to this point by an unbelievably wide margin. My first words after reaching the top and turning to look back towards Crawfor Notch was a simple &quot;Holy shit...&quot; and it&#39;s honestly tough to describe it better than that. We summited right around 12:30pm, and spent an hour on the summit taking pictures, eating lunch, and sharing some snacks with a couple more gray jays. Though it was a little cold and breezy, we were prepared for that with hats and gloves and coats, and were comfortable the whole time.</p>\n<p><img src=\"mt-jackson/summit-sign.jpg\" alt=\"Summit sign selfie\" style=\"width: 70%\" /></p>\n<p><img src=\"mt-jackson/summit-view-westward.jpg\" alt=\"The view looking northwest\" style=\"width: 70%\" /></p>\n<p><img src=\"mt-jackson/summit-view-northward.jpg\" alt=\"The view looking north\" style=\"width: 70%\" /></p>\n<p><img src=\"mt-jackson/summit-view-eastward.jpg\" alt=\"The view looking northeast\" style=\"width: 70%\" /></p>\n<p><img src=\"mt-jackson/summit-cairn.jpg\" alt=\"The cairn on the summit, with Washington in the background\" style=\"width: 70%\" /></p>\n<p>If you look closely in the final picture, on the slopes of Mt. Pierce just above the top of the cairn you can see Mizpah Springs Hut, one of the many AMC huts that offer food and lodging in the White Mountains. </p>\n<p>After around an hour at the summit the wind started to pick up and we took that as a sign to head back down. The descent was uneventful, and we took our time to make sure nobody got injured. As is often the case, the way down feels longer and more tiresome than the ascent, but we still had the energy to check out Bugle Cliff and Elephant Head (the pics from these spots are earlier in the post). We finally made it back down around 4:30pm, over an hour later than expected due to taking so many photos. </p>\n"}