{"title":"Mt. Waumbek - 9/17/22","slug":"Mt-Waumbek","order":13,"html":"<h2 id=\"4006-feet---72-mi\">4006 feet - 7.2 mi</h2>\n<hr style=\"border: 1px solid black\"><p>My dad and brother had been looking to do another hike this year, and so was I. We discussed timing and this weekend of Sept. 17th seemed like the best option. It also happened to be the 5th anniversary of the day we got my dog Lana, so I wanted to take her along on the hike to celebrate. With her and my dad in the hiking party, I wanted to make sure it was something on the easy side, but I was still intent on bagging another a 4000-footer. Our hike of <a href=\"/summits/Mt-Osceola\">Mt. Osceola</a> was about the limit for both of them, with my dad&#39;s knees and Lana&#39;s paws taking a beating from it. A little research suggested Mt. Waumbek was the best option. In terms of length it was actually a bit longer than Osceola, but the terrain was supposed to be much easier. The only downside was that it was 2.5 hours away which meant getting a very early start.</p>\n<p><img src=\"mt-waumbek/excited-lana.jpg\" alt=\"Lana waiting impatiently\" style=\"width: 70%\" /></p>\n<p>At 4:30am I got out of bed, roused the dog, and tiptoed downstairs, trying to avoid waking up my wife or baby. I informed Lana that we were going hiking and she spent the next hour waiting by the door. We left the house around 5:45am, a bit later than intended, because the baby woke up and so I helped my wife get him changed and fed before I left. The drive was a long one, but we made good time and actually arrived before my dad and brother, who were running later than I was. Lana was excited to see them both, and we got started up the trail a bit before 9:00am.</p>\n<p><img src=\"mt-waumbek/trailhead-sign.jpg\" alt=\"Trailhead sign\" style=\"width: 70%\" /></p>\n<p>As expected, the trail was pretty straightforward. It climbed steadily, but not too steeply, up a ridge towards the 3907 foot peak of Mt. Starr King, which you must cross before reaching Mt. Waumbek. The trail was a little rocky in parts (it&#39;s the White Mountains after all) but mostly had good footing. The hiking itself was unremarkable, but there were a few interesting landmarks in those first 2.6 miles. Just a couple hundred yards past the trailhead there was this old well-like structure. No idea what exactly it was or how old it is. </p>\n<p><img src=\"mt-waumbek/well.jpg\" alt=\"Stone well structure\" style=\"width: 70%\" /></p>\n<p>About halfway up, we noticed a sign for a spring off to the left of the trail. There was a tiny amount of water trickling out from under a large rock just off the path, and with no side trail leading anywhere else I can only assume that was the spring. Perhaps in other times of the year there&#39;s more than a dribble, but I wouldn&#39;t want to rely on that for a water source. </p>\n<p><img src=\"mt-waumbek/spring-sign.jpg\" alt=\"Small wooden sign for the spring\" style=\"width: 70%\" /></p>\n<p><img src=\"mt-waumbek/actual-spring.jpg\" alt=\"The spring itself, barely a trickle\" style=\"width: 70%\" /></p>\n<p>Just below the summit of Mt. Starr King was a tiny rock scramble. Lana watched my dad clamber up it, and then unexpectedly did a parkour-style wall jump off the left side to get up it herself. I have never seen her do anything like that and was suprised. I&#39;d anticipated needing to give her a boost.</p>\n<p><img src=\"mt-waumbek/hardest-part.jpg\" alt=\"The small rock scramble\" style=\"width: 70%\" /></p>\n<p>Just above this on the right side of the trail was a small cairn indicating the true summit of Mt. Starr King. Another 20 feet and the trail opened up into a large flat area with a narrow but impressive view towards the Presidential range. At one time there was a shelter or cabin of some kind here, but all that remains of it now is a stone fireplace, which, based on the ash inside it, still sees occasional use by hikers.</p>\n<p><img src=\"mt-waumbek/starr-king-view.jpg\" alt=\"The view from Mt. Starr King\" style=\"width: 70%\" /></p>\n<p><img src=\"mt-waumbek/chimney.jpg\" alt=\"The old stone fireplace\" style=\"width: 70%\" /></p>\n<p>We took a short break here to catch our breath and snap some pictures before moving on. To the right of the fireplace is a small sign that simply reads &quot;PATH&quot;, indicating the route over to Mt. Waumbek. The trail between them has minimal elevation change, and was a bit overgrown and muddy. In about 20 minutes we had found ourselves at a small clearing with a large cairn and a couple signs indicating the viewless summit of Mt. Waumbek and some distances to other places. </p>\n<p><img src=\"mt-waumbek/waumbek-cairn.jpg\" alt=\"The Waumbek summit cairn\" style=\"width: 70%\" /></p>\n<p><img src=\"mt-waumbek/waumbek-sign.jpg\" alt=\"A sign at the summit pointing back to Mt. Starr King\" style=\"width: 70%\" /></p>\n<p><img src=\"mt-waumbek/waumbek-sign-2.jpg\" alt=\"A sign at the summit providing distances to 2 more location\" style=\"width: 70%\" /></p>\n<p>It was around 11:30am at this point and so we stopped for lunch there. Lana looked jealously at my sandwich but ate only the dog food I&#39;d brought for her and a little bit of some fruit I&#39;d brought for myself.</p>\n<p><img src=\"mt-waumbek/sandwich-stinkeye.jpg\" alt=\"Lana eyeballing my sandwich\" style=\"width: 70%\" /></p>\n<p>After lunch, we headed back the way we came. The hike back was as unremarkable as the first time through, except that our feet and legs were more sore and so there was a bit more complaining. We reached the parking lot around 2:30pm and said our goodbyes. While it was good to see my family and knock out another 4000-footer, I won&#39;t be rushing to do this one again. Not that it was a bad hike per se, but if I&#39;m going to be driving for more than 2 hours one way I&#39;d rather do something more interesting. </p>\n"}